
#+NAME: generic
| 2022-07-21 |       27181.1 |

#+BEGIN: ods-table :label "generic"
| 2022-07-21 | 27181.1 |

#+END:

#+NAME: table1
#+CAPTION: Table 1
| Student  | Mark1 | Mark2 | Mark3 | Result | Result-simple | ResultSkaled |
|----------+-------+-------+-------+--------+---------------+--------------|
| Student1 |     2 |     3 |     4 |      9 |             9 |          900 |
| Student2 |     4 |     2 |     1 |      7 |             7 |          700 |
#+TBLFM: $5=vsum($2..$4)::$6=$2+$3+$4::$7=vsum($2..$4)*100

#+BEGIN: ods-table :label "table1"
| Student  | Mark1 | Mark2 | Mark3 | Result      | Result-simple | ResultSkaled    |
|----------+-------+-------+-------+-------------+---------------+-----------------|
| Student1 |     2 |     3 |     4 | =SUM(B2:D2) | =B2+C2+D2     | =SUM(B2:D2)*100 |
| Student2 |     4 |     2 |     1 | =SUM(B3:D3) | =B3+C3+D3     | =SUM(B3:D3)*100 |

#+END:


#+NAME: table2
#+CAPTION: Table 2
| Account      |     |
|--------------+-----|
| Account1     | 200 |
| Account1     | 300 |
|--------------+-----|
| All accounts | 500 |
#+TBLFM: @4$2=vsum(@I..@II)

#+BEGIN: ods-table :label "table2"
| Account      |             |
|--------------+-------------|
| Account1     |         200 |
| Account1     |         300 |
|--------------+-------------|
| All accounts | =SUM(B2:B3) |

#+END:


#+NAME: table3
#+CAPTION: Table 3
| First |   |     |
|-------+---+-----|
|     3 | 6 |   9 |
|     1 | 3 |   4 |
|     1 | 2 |   3 |
|     8 | 9 |  17 |
|   100 | 1 | 101 |
#+TBLFM: $3=vsum($1..$2);f-2::@2$3=vsum(@2$1..@2$2)

#+BEGIN: ods-table :label "table3"
| First |   |             |
|-------+---+-------------|
|     3 | 6 | =SUM(A2:B2) |
|     1 | 3 | =SUM(A3:B3) |
|     1 | 2 | =SUM(A4:B4) |
|     8 | 9 | =SUM(A5:B5) |
|   100 | 1 | =SUM(A6:B6) |

#+END:


#+NAME: table4
#+CAPTION: Table 4
|---+---------+--------+--------+--------+-------+------|
|   | Student | Prob 1 | Prob 2 | Prob 3 | Total | Note |
|---+---------+--------+--------+--------+-------+------|
| ! |         |     P1 |     P2 |     P3 |   Tot |      |
| # | Maximum |     10 |     15 |     25 |    50 | 10.0 |
| ^ |         |     m1 |     m2 |     m3 |    mt |      |
|---+---------+--------+--------+--------+-------+------|
| # | Peter   |     10 |      8 |     23 |    41 |  8.2 |
| # | Sam     |      2 |      4 |      3 |     9 |  1.8 |
|---+---------+--------+--------+--------+-------+------|
|   | Average |        |        |        |  25.0 |      |
| ^ |         |        |        |        |    at |      |
| $ | max=50  |        |        |        |       |      |
|---+---------+--------+--------+--------+-------+------|
#+TBLFM: $6=vsum($P1..$P3)::$7=10*$Tot/$max;%.1f

#+BEGIN: ods-table :label "table4"
|---------+--------+--------+--------+-------------+-----------|
| Student | Prob 1 | Prob 2 | Prob 3 | =SUM(B1:D1) | =10*E1/50 |
|---------+--------+--------+--------+-------------+-----------|
| Maximum |     10 |     15 |     25 | =SUM(B2:D2) | =10*E2/50 |
|---------+--------+--------+--------+-------------+-----------|
| Peter   |     10 |      8 |     23 | =SUM(B3:D3) | =10*E3/50 |
| Sam     |      2 |      4 |      3 | =SUM(B4:D4) | =10*E4/50 |
|---------+--------+--------+--------+-------------+-----------|
| Average |        |        |        | =SUM(B5:D5) | =10*E5/50 |
|---------+--------+--------+--------+-------------+-----------|

#+END:


#+NAME: rownos
| Col.No | Arithemetic Progression |
|--------+-------------------------|
|      1 |                       8 |
|      2 |                      11 |
|      3 |                      14 |
|      4 |                      17 |
#+TBLFM: $1=@#-1::$2=3*$1+5

#+BEGIN: ods-table :label "rownos"
| Col.No   | Arithemetic Progression |
|----------+-------------------------|
| =ROW()-1 | =3*A2+5                 |
| =ROW()-1 | =3*A3+5                 |
| =ROW()-1 | =3*A4+5                 |
| =ROW()-1 | =3*A5+5                 |

#+END:


#+NAME: colnos
|   1 |   2 |   3 |    4 |    5 |    6 |
| 3.5 | 6.5 | 9.5 | 12.5 | 15.5 | 18.5 |
#+TBLFM: @1=$#::@2=3*@1+0.5

#+BEGIN: ods-table :label "colnos"
| =COLUMN() | =COLUMN() | =COLUMN() | =COLUMN() | =COLUMN() | =COLUMN() |
| =3*A1+0.5 | =3*B1+0.5 | =3*C1+0.5 | =3*D1+0.5 | =3*E1+0.5 | =3*F1+0.5 |

#+END:


#+NAME: lhsranges
#+CAPTION: Quarterly Revenue
#+ATTR_ODT: :style "Academic"
|       | Jan | Feb | Mar |
|-------+-----+-----+-----|
| North | 5.1 | 1.7 | 5.6 |
| South | 7.6 | 3.7 | 0.4 |
| East  | 9.5 | 0.4 | 9.6 |
| West  | 4.8 | 5.7 | 5.9 |
|-------+-----+-----+-----|
| Sum   |     |     |     |
#+TBLFM: @6$2..@6$4=vsum(@I..@II)

#+BEGIN: ods-table :label "lhsranges"
|       |         Jan |         Feb |         Mar |
|-------+-------------+-------------+-------------|
| North |         5.1 |         1.7 |         5.6 |
| South |         7.6 |         3.7 |         0.4 |
| East  |         9.5 |         0.4 |         9.6 |
| West  |         4.8 |         5.7 |         5.9 |
|-------+-------------+-------------+-------------|
| Sum   | =SUM(B2:B5) | =SUM(C2:C5) | =SUM(D2:D5) |

#+END:


#+NAME: revenue
#+CAPTION: Quarterly Revenue
#+ATTR_ODT: :style "Academic"
|       | Jan | Feb | Mar | Sum |
|-------+-----+-----+-----+-----|
| North | 5.1 | 1.7 | 5.6 |     |
| South | 7.6 | 3.7 | 0.4 |     |
| East  | 9.5 | 0.4 | 9.6 |     |
| West  | 4.8 | 5.7 | 5.9 |     |
|-------+-----+-----+-----+-----|
| Sum   |     |     |     |     |
#+TBLFM: $5=vsum($2..$4)::@6$2..@6$4=vsum(@I..@II)::@>$>=vsum(@I..@II)

#+BEGIN: ods-table :label "revenue"
|       |         Jan |         Feb |         Mar | Sum         |
|-------+-------------+-------------+-------------+-------------|
| North |         5.1 |         1.7 |         5.6 | =SUM(B2:D2) |
| South |         7.6 |         3.7 |         0.4 | =SUM(B3:D3) |
| East  |         9.5 |         0.4 |         9.6 | =SUM(B4:D4) |
| West  |         4.8 |         5.7 |         5.9 | =SUM(B5:D5) |
|-------+-------------+-------------+-------------+-------------|
| Sum   | =SUM(B2:B5) | =SUM(C2:C5) | =SUM(D2:D5) | =SUM(E2:E5) |

#+END:


#+NAME: hline1
#+CAPTION: Table 2
|----------+-----+-----+-----|
| Account1 | 100 | 200 | 500 |
| Account1 | 300 | 400 | 600 |
|----------+-----+-----+-----|
| Sum      |     |     |     |
#+TBLFM: @3$2..@3$4=vsum(@I..@II)

#+BEGIN: ods-table :label "hline1"
|----------+-------------+-------------+-------------|
| Account1 |         100 |         200 |         500 |
| Account1 |         300 |         400 |         600 |
|----------+-------------+-------------+-------------|
| Sum      | =SUM(B1:B2) | =SUM(C1:C2) | =SUM(D1:D2) |

#+END:


#+NAME: hline2
#+CAPTION: Table 2
| Account1 | 100 | 200 | 500 |
| Account1 | 300 | 400 | 600 |
|----------+-----+-----+-----|
| Sum      |     |     |     |
#+TBLFM: @3$2..@3$5=vsum(@1..@2)

#+BEGIN: ods-table :label "hline2"
| Account1 |         100 |         200 |         500 |
| Account1 |         300 |         400 |         600 |
|----------+-------------+-------------+-------------|
| Sum      | =SUM(B1:B2) | =SUM(C1:C2) | =SUM(D1:D2) |

#+END:


#+NAME: string-in-header-row
#+CAPTION: String in Header Row
| Mark1 | Mark2 |   |
|-------+-------+---|
|    13 |     7 |   |
|     2 |    10 |   |
#+TBLFM: $3=vsum($1..$2);f2::@1$3=ResFinal

# TODO: ResFinal has to appear on the header column

#+BEGIN: ods-table :label "string-in-header-row"
| Mark1 | Mark2 |             |
|-------+-------+-------------|
|    13 |     7 | =SUM(A2:B2) |
|     2 |    10 | =SUM(A3:B3) |

#+END:


#+NAME: table5
# #+CAPTON: Table 5
# |---+---------+--------+--------+--------+-------+------|
# |   | Student | Prob 1 | Prob 2 | Prob 3 | Total | Note |
# |---+---------+--------+--------+--------+-------+------|
# | ! |         |     P1 |     P2 |     P3 |   Tot |      |
# | # | Maximum |     10 |     15 |     25 |    50 | 10.0 |
# | ^ |         |     m1 |     m2 |     m3 |    mt |      |
# |---+---------+--------+--------+--------+-------+------|
# | # | Peter   |     10 |      8 |     23 |    41 |  8.2 |
# | # | Sam     |      2 |      4 |      3 |     9 |  1.8 |
# |---+---------+--------+--------+--------+-------+------|
# |   | Average |        |        |        |  25.0 |      |
# | ^ |         |        |        |        |    at |      |
# | $ | max=50  |        |        |        |       |      |
# |---+---------+--------+--------+--------+-------+------|
# #+TBLFM: $6=vsum($P1..$P3)::$7=10*$Tot/$max;%.1f::$at=vmean(@-II..@-I);%.1f

# #+BIND: TABLE_CONVERTER_ENV (("LANG" "de_DE.UTF-8"))

# Local Variables:
# ox-ods-debug: nil
# eval: (hi-lock-mode 1)
# eval: (highlight-lines-matching-regexp (rx (and "TODO")) 'hi-salmon))
# eval: (highlight-lines-matching-regexp (rx (and "#+NAME:")) 'hi-yellow))
# eval: (highlight-lines-matching-regexp (rx (and "#+BEGIN: ods-table")) 'highlight))
# End:
